{
  "main": {
    "name": "Mayank Solan",
    "occupation": "Frontend Developer",
    "description": "currently employed by GiveIndia where I push pixels, loops on data, and test my code until everything works",
    "image": "profilepic.jpg",
    "bio": "A self driven person with a passion for coding and love for web development, learning Javascript / CSS / HTML every day trying to become a better developer. Exploring the React world with Redux/NextJs. A person who takes great care in delivering with getting the right things in right places in defined time with clear communication.",
    "contactmessage": "Drop in a message below to reach out to me",
    "email": "mayanksolan@gmail.com",
    "phone": "+91-988-677-7015",
    "address": {
      "street": "HSR Layout",
      "city": "Bengaluru",
      "state": "Karnataka",
      "zip": "560102"
    },
    "website": "",
    "resumedownload": "",
    "social": [
      {
        "name": "facebook",
        "url": "http://facebook.com/mayanksolan",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "http://twitter.com/mayanksolan",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/mayank-solan-42628915/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "http://instagram.com/mayanksolan",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "http://github.com/mayanksolan",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Below are some of the technologies used in my Web development career",
    "education": [
      {
        "school": "UPTU",
        "degree": "B-Tech",
        "graduated": "2008",
        "description": "Completed graduation in Information Technology branch"
      }
    ],
    "work": [
      {
        "company": "GiveIndia",
        "title": "Frontend Developer - SDE-2",
        "years": "April 2021 - Present",
        "description": "Independently implemented the Checkout for fundraisers platform | Handled a team and revamped the GiveIndia homepage in a short span of time | Completion of the revamped fundraiser dashboard with requirements gathering and delivering on time"
      },
      {
        "company": "GiveIndia",
        "title": "Frontend Developer - SDE-1",
        "years": "January 2020 - March 2021",
        "description": "This was the full time Web developer job where I worked pimarly on MERN stack. Created Missions Pages from scratch in subscriptions platform | Created around 50+ microsites for Covid relief which were highly customizable with components laid out on requirements | Created self serve feature for the nonprofits | Google Analytics implementation across repos"
      },
      {
        "company": "Accenture",
        "title": "Frontend Developer - Software Engineer",
        "years": "June 2018 - May 2019",
        "description": "While working as a team lead got a chance to work as a web developer in one of the projects for the same client. The application to provide the functionality to third-party contracts for Sign-On which allows agents to search customers through account numbers, phone and provides a list of available contracts to sign. The technology used was React / Redux. I could only devote around 40% of my office time for this project as my primary task was still as a Data Analyst"
      },
      {
        "company": "Wipro Technologies, Birlasoft, Accenture",
        "title": "Data Analyst, Data Engineer - Software Engineer to Team Lead",
        "years": "2009 - 2018",
        "description": "Started my career as a Data analyst with primary role of reading the dataset of large corporations and transforming the same data into business useful format which could be used for making faster decisions at higher levels in the organizations. Worked in different projects as Data Analyst (as Developer / Team Lead) in Data Warehousing across different domains and with different customers and implemented large DW projects. Worked in lot of different technologies such as ETL tools - Informatica / Talend, Databases - BigData / Sql Server / Teradata / DB2 / Oracle / Netezza, Other Tech - Informatica Data Quality / UNIX / PL-SQL / Autosys / Cronacle / Oracle Application Express / SQL Data Modeler / Salesforce"
      }
    ],
    "skills": [
      {
        "name": "Javascript",
        "path": "/images/skills/javascript.png",
        "level": "70%"
      },
      {
        "name": "HTML",
        "path": "/images/skills/html.png",
        "level": "80%"
      },
      {
        "name": "CSS",
        "path": "/images/skills/css.png",
        "level": "65%"
      },
      {
        "name": "Git",
        "path": "/images/skills/git.png",
        "level": "60%"
      },
      {
        "name": "ReactJs",
        "path": "/images/skills/react.png",
        "level": "90%"
      },
      {
        "name": "Redux",
        "path": "/images/skills/redux.png",
        "level": "80%"
      },
      {
        "name": "NextJs",
        "path": "/images/skills/nextjs.png",
        "level": "80%"
      },
      {
        "name": "Typescript",
        "path": "/images/skills/typescript.png",
        "level": "70%"
      },
      {
        "name": "SASS",
        "path": "/images/skills/sass.png",
        "level": "70%"
      },
      {
        "name": "Material-UI",
        "path": "/images/skills/materialui.png",
        "level": "70%"
      },
      {
        "name": "Bootstrap",
        "path": "/images/skills/bootstrap.png",
        "level": "70%"
      },
      {
        "name": "MongoDB",
        "path": "/images/skills/mongodb.png",
        "level": "60%"
      },
      {
        "name": "Postgresql",
        "path": "/images/skills/postgresql.png",
        "level": "60%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Canadian Wanderlust",
        "category": "My Travel Blog for my post-university travels",
        "image": "canadian-wanderlust.jpg",
        "url": "https://www.canadianwanderlust.com"
      },
      {
        "title": "Fury Fighting Gear",
        "category": "(offline now) A fighting gear company I started",
        "image": "fury-fighting-gear.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Original Thai Food",
        "category": "Website I built for a restaurant I like in Thailand",
        "image": "original-thai-food.jpg",
        "url": "http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title": "Resume Website",
        "category": "A React based resume website template",
        "image": "resume-website.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Smirkspace",
        "category": "(MVP Only) A React and Meteor based chat University project.",
        "image": "smirkspace.jpg",
        "url": "http://www.smirkspace.com"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I worked with Mayank in a high powered data integration team at BirlaSoft. He is an amazing team player and has the ability to galvanize the team around him, boosting the morale and technical know how. It was a pleasure working with him, and any team will benefit with Mayank in its ranks.",
        "user": "Arihant Surana",
        "designation": "Principal Data Systems Engineer at Nearmap"
      },
      {
        "text": "Mayank is a very amazing person. It was my pleasure to be his subordinate and the experience is like a treasure to me. He is one of the person with whom everyone wants to work, either with or for. He is having a perfect blend of professionalism and organisational skills. He aspire his subordinate to excel in their field and is always ready to help them grow. Along with the great leadership skills, Mayank is a fantastic techie having huge knowledge in the field of Business Intelligence including ETL tools like Talend and Informatica. Apart from BI he is excellent in UNIX and SQL and had worked on most of the databases. He is having a very sound knowledge in the field of Android development and Java. His requirement gathering and analyzing skills had saved a lot of efforts in our project which helps us in delivering in time. His enthusiasm and hunger to grasp the opportunities of learning new technologies, say it big data, data science or cloud, aspire other team members to grow and ameliorate their professional skills.",
        "user": "Pragyawan",
        "designation": "Team Lead in Accenture"
      },
      {
        "text": "Mayank is one of the best leaders I worked with. He is a rare combination of patience, dedication, flexibility with a versatile skill set. He is full of ideas and strategies and works smartly even under pressure. Undoubtedly a true leader who is equally interested in his colleagues' growth as his own.",
        "user": "Sahibi Parnami",
        "designation": "Mulesoft Integration Lead"
      },
      {
        "text": "I've worked along side Mayank for close to two years as test engineer in his projects. Through those two years, I have seen Mayank rose from a fresher in the project to a lead position taking ownership of the delivery. Mayank has shown exceptional skills in delivering ETL pipelines at the right time. He was our go to guy in critical circumstances. I have seen him starting as fresher and developing his expertise in various database platforms as Oracle, Netezza et al. As someone from testing team, I have seen development team's go to guy in critical circumstances was Mayank. Mayank has always taken care of critical defects and in helping his team to reach the finish line. When Mayank left the job, he was leading a team of developers, architecting ETL solution and primary face of Dev team for our Customers. He was never tired of reaching out to external teams like us and other stakeholders to get the job done. Mayank has this skill of getting job done in most difficult circumstances from the people. The way Mayank took the ownership and led the team was always delightful to watch and work along. Not only me, anybody, would like to work alongside an engineer like Mayank. I wish you all the best buddy.",
        "user": "Santhosh Venkatraman",
        "designation": "Sr. Application Developer Starbucks"
      },
      {
        "text": "It was a great experience working with you and how you transformed a critical Leadpro Analytics project into a simpler one is absolutely brilliant.",
        "user": "Arijit Sarkar",
        "designation": "Cloud Data Engineer at Meredith Corporation"
      }
    ]
  }
}
